import 'domain/sight.dart';

final List mocks = <Sight>[
  Sight(
    nameSights: 'Триумфальная арка',
    lat: 55.737064,
    lon: 37.520018,
    url: 'https://architectureguru.ru/triumfalnaya-arka-v-moskve/',
    type: 'достопримечательность',
    details:
        'Триумфальная арка или Триумфальные ворота в Москве – объект культурного наследия, расположенный на Кутузовском проспекте. Памятник воздвигнут в честь победы русского народа над Наполеоном в 1812 году. Достопримечательность относится к самым известным триумфальным воротам и аркам мира.',
  ),
  Sight(
    nameSights: 'Бункер-42 на Таганке',
    lat: 55.742583,
    lon: 37.649447,
    url: 'http://bunker42.com',
    type: 'музей',
    details:
        'Военно-исторический музей и развлекательный комплекс в Москве в 5-м Котельническом переулке рядом со станцией метро «Таганская». Основан в 2006 году. Расположен в подземном бункере площадью более 7000 м² на глубине 65 метров на территории бывшего засекреченного военного объекта СССР - Запасного командного пункта дальней авиации.',
  ),
  Sight(
    nameSights: 'Нереальное место',
    lat: 55.762781,
    lon: 37.664158,
    url: 'https://nerealnoemesto.ru',
    type: 'развлечения',
    details:
        'Клуб виртуальной реальности, парк аттракционов. У нас 70 лучших VR-игр, всех жанров и для всех возрастов.',
  ),
  Sight(
    nameSights: 'Московский кремль',
    lat: 55.751549,
    lon: 37.618879,
    url: 'https://www.kreml.ru',
    type: 'достопримечательность',
    details:
        'Московский Кремль — один из крупнейших архитектурно-градостроительных ансамблей мира. Он раскинулся в центре столицы России на высоком холме над Москвой-рекой. Высота стен Кремля, узкие бойницы, площадки боя, мерный шаг башен — все говорит о том, что прежде всего это крепость. Но стоит войти в Кремль — и впечатление меняется.',
  ),
  Sight(
    nameSights: 'Выставка достижений народного хозяйства',
    lat: 55.826690,
    lon: 37.637578,
    url: 'https://vdnh.ru',
    type: 'достопримечательность',
    details:
        'Выставочный комплекс в Останкинском районе Северо-Восточного административного округа города Москвы, второй по величине выставочный комплекс в городе. Входит в 50 крупнейших выставочных центров мира. Ежегодно ВДНХ посещают 30 млн гостей.',
  ),
  Sight(
    nameSights: 'Государственная Третьяковская галерея',
    lat: 55.742251,
    lon: 37.620522,
    url: 'https://www.tretyakovgallery.ru',
    type: 'музей',
    details:
        'Московский художественный музей, основанный в 1856 году купцом Павлом Третьяковым. В 1867-м галерея была открыта для посещения, а в 1892 году передана в собственность Москве. На момент передачи коллекция музея насчитывала 1276 картин, 471 рисунок, десять скульптур русских художников, а также 84 картины иностранных мастеров.',
  ),
  Sight(
    nameSights: 'Государственный академический Большой театр России',
    lat: 55.760245,
    lon: 37.618832,
    url: 'https://www.bolshoi.ru',
    type: 'театр',
    details:
        'Один из крупнейших в России и один из самых значительных в мире театров оперы и балета. Комплекс зданий театра расположен в центре Москвы, на Театральной площади.',
  ),
];
